{
  "timestamp_utc": "2026-02-16T03:27:21.937907+00:00",
  "session_id": "672447e575424c248bedc7066a5b4ac6",
  "agent": "analyzer",
  "payload": {
    "message": "analyzer ok",
    "session_id_seen": "672447e575424c248bedc7066a5b4ac6",
    "input_chars": 1163,
    "detectors": [
      {
        "name": "Suspicious sign-in chain (new geo/device + MFA fatigue + success)",
        "goal": "Detect account takeover patterns leveraging stolen credentials and MFA prompt bombing.",
        "data_needed": [
          "IdP sign-in logs",
          "MFA events",
          "Conditional Access / risk events (if available)"
        ],
        "detection_logic": "Trigger when a user exhibits a deviation from their 30-day behavioral baseline in authentication patterns, including: (1) repeated MFA push prompts or denials within a short window (possible MFA fatigue), followed by (2) a successful sign-in from a new geographic location or previously unseen device fingerprint. Increase risk score if the login occurs outside the user’s typical working hours or differs significantly from their historical geo/device profile and peer group behavior.",
        "expected_false_positives": "Users traveling or changing devices; noisy MFA prompts from misconfigured apps.",
        "tuning_ideas": "Whitelist known travel patterns; require 'new device' AND 'new geo'; add user baseline hours.",
        "rationale": "Aligned with DBIR themes: credential abuse + MFA fatigue. Telemetry check: IdP logs=yes.",
        "telemetry_flags": {
          "idp": true,
          "edr": true,
          "cloud": true,
          "dns": true,
          "proxy": true,
          "db": true
        },
        "category_hint": "ATO"
      },
      {
        "name": "Potential vulnerability exploitation leading to privileged session",
        "goal": "Detect suspicious privileged access shortly after unusual external access and sensitive changes.",
        "data_needed": [
          "Cloud audit logs or server logs",
          "IdP logs",
          "EDR process telemetry (if available)"
        ],
        "detection_logic": "Trigger when an administrative interface or cloud management plane is accessed from a source/IP that deviates from the entity’s historical access profile (new ASN, geo, or IP reputation anomaly), followed within 30–60 minutes by privilege-escalating actions (role assignment, new admin creation, API key issuance). Elevate risk if the access pattern differs from the user’s or service account’s normal operational baseline and falls outside peer group change frequency.",
        "expected_false_positives": "Legitimate admin work from new IPs; responders; new VPN exit nodes.",
        "tuning_ideas": "Require correlation with change events; whitelist corporate VPN; add geo/device baseline.",
        "rationale": "Aligned with DBIR theme: increased initial access via vulnerability exploitation. Telemetry check: cloud_audit=yes.",
        "telemetry_flags": {
          "idp": true,
          "edr": true,
          "cloud": true,
          "dns": true,
          "proxy": true,
          "db": true
        },
        "category_hint": "EXPLOIT_PRIVESC"
      },
      {
        "name": "Ransomware early behavior (mass file ops + recovery tampering)",
        "goal": "Detect early ransomware-like behavior before widespread encryption impact.",
        "data_needed": [
          "EDR process + file telemetry",
          "Windows Security logs (optional)"
        ],
        "detection_logic": "Trigger when endpoint telemetry shows file modification or rename rates significantly exceeding the host’s historical baseline (e.g., sudden spike across multiple directories), combined with behaviors associated with recovery tampering such as shadow copy deletion, backup service termination, or abnormal process tree lineage. Increase confidence if the process lineage deviates from typical administrative or backup tool behavior observed in the last 30 days.",
        "expected_false_positives": "Backup/restore tools; mass updates; IT scripts.",
        "tuning_ideas": "Allowlist known agents; require combination of mass file ops + recovery tampering.",
        "rationale": "Aligned with DBIR theme: ransomware prevalence in system intrusion patterns. Telemetry check: edr=yes.",
        "telemetry_flags": {
          "idp": true,
          "edr": true,
          "cloud": true,
          "dns": true,
          "proxy": true,
          "db": true
        },
        "category_hint": "RANSOMWARE"
      },
      {
        "name": "Mass data export + unusual egress destination",
        "goal": "Detect potential data theft via abnormal export followed by outbound transfer.",
        "data_needed": [
          "App audit logs or DB audit logs",
          "Proxy logs or Firewall logs",
          "DNS logs (optional)"
        ],
        "detection_logic": "Trigger when a user or service account performs a data export or query whose volume (rows/bytes) significantly exceeds their 30-day historical average and deviates from their peer group’s normal behavior, followed within 15–60 minutes by outbound network communication to a new or low-prevalence external domain. Increase risk score if the destination has no prior communication history for that user or host.",
        "expected_false_positives": "Reporting periods; migrations; BI jobs.",
        "tuning_ideas": "Baseline per role; require 'new destination' + 'large export' correlation; add time windows.",
        "rationale": "Aligned with DBIR themes: credential abuse/insider + exfil outcomes. Telemetry check: proxy=yes, db_logs=yes.",
        "telemetry_flags": {
          "idp": true,
          "edr": true,
          "cloud": true,
          "dns": true,
          "proxy": true,
          "db": true
        },
        "category_hint": "EXFIL"
      },
      {
        "name": "Third-party access anomaly (vendor account deviates from normal patterns)",
        "goal": "Detect risky vendor/partner access outside expected time/systems.",
        "data_needed": [
          "IdP logs",
          "VPN logs (if used)",
          "App audit logs"
        ],
        "detection_logic": "Trigger when a vendor or third-party account deviates from its established behavioral profile, including access to new critical systems, authentication outside historically observed time windows, or privilege modification attempts. Increase anomaly score if the access pattern differs from both the account’s 30-day baseline and from the standard behavior of other vendor accounts within the same peer group.",
        "expected_false_positives": "Planned maintenance; emergency support windows.",
        "tuning_ideas": "Define vendor allowlist; enforce time windows; require step-up auth for exceptions.",
        "rationale": "Aligned with DBIR theme: increased third-party involvement. Telemetry check: idp=yes.",
        "telemetry_flags": {
          "idp": true,
          "edr": true,
          "cloud": true,
          "dns": true,
          "proxy": true,
          "db": true
        },
        "category_hint": "THIRD_PARTY"
      }
    ]
  }
}